Revit 2027 API
BuiltInFailures.StairRampFailures.StairsSubElementsNotConnectedWarning Property
 Stair sub-elements are not connected
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsSubElementsNotConnectedWarning { get; }
Public Shared ReadOnly Property StairsSubElementsNotConnectedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsSubElementsNotConnectedWarning {
	FailureDefinitionId^ get ();
}
static member StairsSubElementsNotConnectedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace